function h4=get_h4_second(k,d,h1,T_out,T_in,T_end,Tk)
%9个未知数，9个方程(对h1赋值，故h1可视为已知,此时仅h4和a1234b1234为未知)，最终返回h4
%% 参数
x0=0;
x1=d(1);
x2=d(1)+d(2);
x3=d(1)+d(2)+d(3);
x4=d(1)+d(2)+d(3)+d(4);

%% 解出a，b（h1）
%A*X=B;
X=zeros(8,1);
A=[-(k(1)+h1*x0) 0 0 0 h1 0 0 0
    x1 -x1 0 0 1 -1 0 0
    0 x2 -x2 0 0 1 -1 0
    0 0 x3 -x3 0 0 1 -1
    k(1) -k(2) 0 0 0 0 0 0
    0 k(2) -k(3) 0 0 0 0 0
    0 0 k(3) -k(4) 0 0 0 0
    0 0 0 x4 0 0 0 1];
B=[h1*(T_out+Tk) 0 0 0 0 0 0 T_end+Tk]';
X=A\B;

%% 解出h4,化简热对流方程得
h4=(-k(4)*X(4))/(x4*X(4)+X(8)-(T_in+Tk));














