clc,clear
X=[2297.86	589.62	474.74	164.19	290.91	626.21	295.20	199.03;
    2262.19	571.69	461.25	185.90	337.83	604.78	354.66	198.96;
    2303.29	589.99	516.21	236.55	403.92	730.05	438.41	225.80;
    2308.70	551.14	476.45	293.23	406.44	785.74	494.04	254.10;
    2337.65	589.28	509.82	334.05	442.50	850.15	563.72	246.51;
    2418.96	618.60	454.20	429.60	615.00	1065.12	594.48	164.28;
    2702.34	735.01	475.36	459.69	790.26	1025.99	741.60	187.81;
    3015.32	779.68	474.15	537.95	865.45	1200.52	903.22	196.77;
    3135.65	849.53	583.50	629.32	929.92	1391.11	882.41	221.85;
    3415.92	1038.98	615.74	705.72	976.02	1449.49	954.56	242.26];
x=zscore(X);         %数据标准化
std=CORRCOEF(x);   %计算相关系数矩阵
[vec,val]=eig(std);   %求特征值(val)及特征向量(vec)
newval=diag(val);  %将特征值作成一个新向量
[y,i]=sort(newval);   %对特征根进行排序，y为排序结果，i为索引
rate=y/sum(y)   %计算贡献率
sumrate=0;
newi=[];
for k=length(y):-1:1
    sumrate=sumrate+rate(k);
    newi(length(y)+1-k)=i(k);
    if sumrate>0.85 break;
    end  
end                %记下累积贡献率大85%的特征值的序号放入newi中
fprintf('主成分数：%g\n\n',length(newi));
for i=1:1:length(newi)      %计算载荷aa
    for j=1:1:length(y)
       aa(i,j)=sqrt(newval(newi(i)))*vec(j,newi(i));
    end
end                    
aaa=aa.*aa;          %主成分载荷归一化zcfhz
for i=1:1:length(newi)
    for j=1:1:length(y)
     zcfhz(i,j)=aa(i,j)/sqrt(sum(aaa(i,:)));
    end
end   
fprintf('主成分载荷：\n'), zcfhz    %输出主成分载荷zcfhz

