#ifndef	__UART_h__
#define	__UART_h__
//	write your header here
#include "SPCE061A.h"

//=============================================================
// 波特率选择
//=============================================================
typedef enum {
	BaudRate300 = 0,
	BaudRate600,
	BaudRate1200,
	BaudRate2400,
	BaudRate4096,
	BaudRate4800,
	BaudRate9600,
	BaudRate14400,
	BaudRate19200,
	BaudRate28800,
	BaudRate38400,
	BaudRate57600,
	BaudRate115200,
	MaxBaudRate
} BAUDRATE;

//=============================================================
// 初始化串口驱动
//=============================================================
void UART_Init(void (*ProcessRxByte)(unsigned char ch));
//=============================================================
// 设置串口波特率
// 参数：		nBaudRate - 波特率
//=============================================================
void UART_BaudSet(BAUDRATE nBaudRate);
//=============================================================
// 发送数据
// 参数：		buf - 发送缓冲区首地址
//				size - 发送数据量（字节）
// 返回值：		0表示成功, -1表示失败
//=============================================================
int UART_Send(const void *buf, int size);
//=============================================================
// 发送字符串
// 参数：		buf - 发送缓冲区首地址
// 返回值：		0表示成功, -1表示失败
//=============================================================
int UART_Send_String(const char *str);

#endif
