dy0=0.01;dl=0.01;M=1670;
l=0;flag=0;%flag用于标识B,C两点的光强度是否满足题设条件；l为线光源长度的一半
while(flag==0)  %光强度条件不满足则继续循环
    y0=36;dotc=0;dotb=0;  %dotc和dotb分别为能够到达B,C两点的光线数目
    while(y0>=-36) %在整个抛物线上（y0=-36~36）,寻找能够到达B点和C点的反射点
        fc=1350810000-9360000*y0-1498200*y0*y0+y0.^4;
        yfc=y0+12000*(15-y0*y0/60)*(-11700-7500*y0+13*y0*y0)/fc;
%yfc为反射后能够到达C点的入射光线与直线x=15的交点的纵坐标
        if(abs(yfc)<=l)   %若 ，就表示找到一个能够到达C点的反射点
            dotc=dotc+1;
        end
        fb=1350810000-4680000*y0-1498200*y0*y0+y0.^4;
        yfb=y0+6000*(15-y0*y0/60)*(-11700-15000*y0+13*y0*y0)/fb;
%yfb为反射后能够到达B点的入射光线与直线x=15的交点的纵坐标
        if(abs(yfb)<=l)  %若 ，就表示找到一个能够到达B点的反射点
            dotb=dotb+1;
        end
        y0=y0-dy0;  %dy0表示步长
    end
    if(dotc>=M)&(dotb>=2*M)  %判断光线的数目是否满足题设条件
        flag=1;
    end
    l=l+dl;   %dl表示点光源的间隔
end
l
