% s o l v e _ e q u a t i o n s .m
clear ;
close all ;
clc ;
%% 参数声明
%syms a1 a2 a3 a4 b1 b2 b3 b4 变量%
syms h1 h5
syms k1 k2 k3 k4
syms x0 x1 x2 x3 x4
syms t1 t2 t3%T
%% 解线性方程组，其中含有1h1  %方程组8除去第二个，加上方程9  %9个未知数8个方程，求出ai，bi（用h1表示）
A1=[ k1 -k2 0 0 0 0 0 0%A1为8*8的矩阵，B1为8*1的矩阵，X1为8*1的矩阵
0 k2 -k3 0 0 0 0 0
0 0 k3 -k4 0 0 0 0%最后一行那三个
x1 -x1 0 0 1 -1 0 0
0 x2 -x2 0 0 1 -1 0
0 0 x3 -x3 0 0 1 -1
0 0 0 x4 0 0 0 1%方程9，下标与原来相比少1
-k1 0 0 0 h1 0 0 0 ] ;
B1 = [ 0 ; 0 ; 0 ; 0 ; 0 ; 0 ; t3 ; h1* t1 ] ;
X1=A1^-1*B1 ;
disp ( simplify (X1) ) ;
%% 解线性方程组，其中含有2h5  %方程组8除去第一个，加上方程9 %9个未知数8个方程，求出ai，bi（用h5表示）
A2=[ k1 -k2 0 0 0 0 0 0
0 k2 -k3 0 0 0 0 0
0 0 k3 -k4 0 0 0 0
x1 -x1 0 0 1 -1 0 0
0 x2 -x2 0 0 1 -1 0
0 0 x3 -x3 0 0 1 -1
0 0 0 x4 0 0 0 1%方程9，下标与原来相比少1
0 0 0 k4+h5*x4 0 0 0 h5 ] ;
B2 = [ 0 ; 0 ; 0 ; 0 ; 0 ; 0 ; t3 ; h5* t2 ] ;
X2=A2^-1*B2 ;
disp ( simplify (X2) ) ;
%% 任一同一变量相等，得到与关系式h1h5
eqn=X1 ( 1 )==X2 ( 1 ) ;%此处让a1=b1
solve ( eqn , h5 )